#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=17e0353ca4c5e46ab918cea3a11c9f17973fb37d]
local_file.tfkey: Refreshing state... [id=4a97d008d9f3a39fad7688b5a2e55ba1c828e752]
aws_vpc.main: Refreshing state... [id=vpc-08fbeb5c2a5835b4e]
data.aws_ami.java-ami: Reading...
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-06c2ffe7cddb975e9]
data.aws_ami.java-ami: Read complete after 0s [id=ami-02281c8b0a2646f13]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-09fd503ac2f813803]
aws_security_group.elb: Refreshing state... [id=sg-03574d5c884dc9d19]
aws_security_group.allow_http: Refreshing state... [id=sg-01ffed9190e0d3190]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0ff8833ee3e0be13a]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-0580c609a910206af]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-098b2568cb30e628f]
aws_security_group.allow_ssh: Refreshing state... [id=sg-0b8cef58390019c0b]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-0247ba74caefb45d0]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0452b383680928659]
aws_launch_template.ec2_config: Refreshing state... [id=lt-0dae325c88523ec16]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-03c6b7ab7626ac70e]
aws_instance.bastion-host: Refreshing state... [id=i-070d5a43cbc5ac12f]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-02c9909aba6a7f0c8]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-0f9246c231b62777b]
aws_route_table.private_route_table: Refreshing state... [id=rtb-0781cd91364473b0f]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-0a4bc636bdecd5586]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-02712839d0ec66f31]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment will be created
  + resource "aws_autoscaling_attachment" "asg_attachment" {
      + autoscaling_group_name = (known after apply)
      + elb                    = "ELB"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.auto_scaling_group will be created
  + resource "aws_autoscaling_group" "auto_scaling_group" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "Auto Scaling Group"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-0580c609a910206af",
          + "subnet-09fd503ac2f813803",
        ]
      + wait_for_capacity_timeout = "10m"

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + min_healthy_percentage = 50
              + skip_matching          = false
            }
        }

      + launch_template {
          + id   = "lt-0dae325c88523ec16"
          + name = (known after apply)
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "App Server"
        }
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*